import 'app_localizations.dart';

/// The translations for Urdu (`ur`).
class AppLocalizationsUr extends AppLocalizations {
  AppLocalizationsUr([String locale = 'ur']) : super(locale);

  @override
  String get registration_agreement => 'ہمارے ساتھ رجسٹریشن کرتے وقت آپ اتفاق کرتے ہیں';

  @override
  String get terms_of_use_and_privacy_policy => 'استعمال کی شرائط اور پرائیویسی پالیسی';

  @override
  String get enter_your_country_code_and_mobile_number_to_login_as_umrah_needer => 'اپنا ملک کوڈ اور موبائل نمبر درج کریں تاکہ ایک امراضی کی طرح لاگ ان کریں';

  @override
  String get mobile_number_without_country_code => 'موبائل نمبر (بغیر ملک کوڈ کے)';

  @override
  String get enter_mobile_number => 'موبائل نمبر درج کریں';

  @override
  String get password => 'پاس ورڈ';

  @override
  String get enter_password => 'پاس ورڈ درج کریں';

  @override
  String get forgot_password => 'پاس ورڈ بھول گئے ہیں؟';

  @override
  String get login => 'لاگ ان';

  @override
  String get create_new_account => 'نیا اکاؤنٹ بنائیں';

  @override
  String get new_registration => 'نیا رجسٹریشن';

  @override
  String get full_name => 'پورا نام';

  @override
  String get enter_your_full_name => 'اپنا پورا نام درج کریں';

  @override
  String get confirm_password => 'پاس ورڈ کی تصدیق کریں';

  @override
  String get enter_password_to_confirm => 'تصدیق کے لئے پاس ورڈ درج کریں';

  @override
  String get passwords_do_not_match => 'پاس ورڈ میچ نہیں ہوتا';

  @override
  String get gender => 'جنس';

  @override
  String get male => 'مرد';

  @override
  String get female => 'عورت';

  @override
  String get register => 'رجسٹر';

  @override
  String get this_user_already_exists => 'یہ صارف پہلے سے موجود ہے';

  @override
  String get enter_phone_number_to_reset_password => 'پاس ورڈ دوبارہ ترتیب دینے کے لئے فون نمبر درج کریں';

  @override
  String get reset_password => 'ری سیٹ';

  @override
  String get enter_your_country => 'اپنا ملک درج کریں';

  @override
  String get new_password_sent_to_your_number => 'نیا پاس ورڈ آپ کے نمبر پر بھیج دیا گیا';

  @override
  String get back_to_registration => 'رجسٹریشن پر واپسی';

  @override
  String get choose_whats_best_for_you => 'وہ کچھ منتخب کریں جو آپ کے لئے بہتر ہو';

  @override
  String get requests => 'درخواستیں';

  @override
  String get notifications => 'اطلاعات';

  @override
  String get settings => 'ترتیبات';

  @override
  String get no_notifications => 'کوئی اطلاعات نہیں';

  @override
  String get ramadan_umrah => 'رمضان عمرہ';

  @override
  String get urgent_umrah_same_day => 'فوری عمرہ (وہی دن)';

  @override
  String get year_round_umrah => 'سال بھر عمرہ';

  @override
  String get umrah_in_rajab => 'رجب میں عمرہ';

  @override
  String get umrah_in_shaaban => 'شعبان میں عمرہ';

  @override
  String get retry => 'دوبارہ کوشش کریں';

  @override
  String get no_requests_yet => 'ابھی تک کوئی درخواست نہیں';

  @override
  String get hello => 'ہیلو،';

  @override
  String get personal_information => 'ذاتی معلومات';

  @override
  String get your_personal_information_like_name_and_mobile_number_and_password => 'آپ کی ذاتی معلومات جیسے نام، موبائل نمبر، اور پاس ورڈ';

  @override
  String get change_currency => 'کرنسی تبدیل کریں';

  @override
  String get change_currency_in_the_app_to_another_currency => 'ایپ میں کرنسی کو دوسری کرنسی میں تبدیل کریں';

  @override
  String get search => 'تلاش کریں';

  @override
  String get discount_code => 'ڈسکاؤنٹ کوڈ';

  @override
  String get enter_discount_code_to_get_discount_now => 'اب ڈسکاؤنٹ حاصل کرنے کے لئے ڈسکاؤنٹ کوڈ درج کریں';

  @override
  String get terms_and_privacy => 'شرائط اور رازداری';

  @override
  String get learn_about_app_terms_and_your_privacy => 'ایپ کی شرائط اور آپ کی رازداری کے بارے میں سیکھیں';

  @override
  String get logout => 'لاگ آوٹ';

  @override
  String get edit => 'ترمیم';

  @override
  String get delete_account => 'اکاؤنٹ حذف کریں';

  @override
  String get new_request => 'نیا درخواست';

  @override
  String get enter_personal_data_of_the_person_for_whom_umrah_will_be_completed => 'وہ شخص کی ذاتی معلومات درج کریں جس کے لئے سروس مکمل کیا جائے گا';

  @override
  String get enter_full_name => 'مکمل نام درج کریں';

  @override
  String get additional_comment => 'اضافی تبصرہ';

  @override
  String get next_step => 'اگلا مرحلہ';

  @override
  String get payment_successful => 'ادائیگی کامیاب ہوگئی\nبراہ کرم انوائس کو محفوظ رکھیں';

  @override
  String get transaction_code => 'ٹرانزیکشن کوڈ';

  @override
  String get amount => 'رقم';

  @override
  String get date => 'تاریخ';

  @override
  String get phone_number => 'فون نمبر';

  @override
  String get done => 'ہوگیا';

  @override
  String get confirm_request => 'درخواست کی تصدیق';

  @override
  String get beneficiary_name => 'مستفید کا نام';

  @override
  String get status => 'حیثیت';

  @override
  String get comment => 'تبصرہ';

  @override
  String get price => 'قیمت';

  @override
  String get payment_in_progress => 'ادائیگی جاری ہے..';

  @override
  String get pay_now => 'اب ادائیگی کریں';

  @override
  String get next => 'اگلا';

  @override
  String get reached_kaaba => 'کعبہ تک پہنچ گیا';

  @override
  String get circumambulate_around_kaaba => 'کعبہ کے گرد طواف';

  @override
  String get saee_between_safa_and_marwah => 'صعی بین صفا اور مروہ';

  @override
  String get hair_cutting => 'بال کاٹنا';

  @override
  String get watch => 'دیکھیں';

  @override
  String get upload_videos => 'ویڈیوز اپ لوڈ کریں';

  @override
  String get uploading_video_in_progress => 'ویڈیو اپ لوڈ ہو رہی ہے..';

  @override
  String get kaaba_reached => 'کعبہ تک پہنچ گیا';

  @override
  String get confirm_completion => 'مکمل ہونے کی تصدیق';

  @override
  String get invalid_phone_number_or_password => 'غلط فون نمبر یا پاس ورڈ';

  @override
  String get retry_again => 'دوبارہ کوشش کریں';

  @override
  String get enter_status => 'حیثیت درج کریں';

  @override
  String get sick => 'بیمار';

  @override
  String get disabled => 'معذور';

  @override
  String get deceased => 'وفات یافتہ';

  @override
  String get other => 'دیگر';

  @override
  String get currency_changed => 'کرنسی تبدیل ہوگئی';

  @override
  String get error_occurred_currency_not_changed => 'غلطی واقع ہوگئی، کرنسی نہیں بدلی گئی';

  @override
  String get data_modified => 'ڈیٹا ترمیم شدہ';

  @override
  String get sure_delete_account => 'کیا آپ اکاؤنٹ کو حذف کرنا چاہتے ہیں؟';

  @override
  String get your_account_will_be_deleted_forever => 'آپ کا اکاؤنٹ ہمیشہ کے لئے حذف کر دیا جائے گا';

  @override
  String get incorrect_phone_number => 'غلط فون نمبر';

  @override
  String get phone_number_already_exists => 'فون نمبر پہلے ہی موجود ہے';

  @override
  String get enter_discount_code => 'ڈسکاؤنٹ کوڈ درج کریں';

  @override
  String get you_have_received_discount => 'آپ کو ڈسکاؤنٹ مل گیا ہے';

  @override
  String get following_umrah => 'عمرہ کا پیچھا کرنا';

  @override
  String get umrah_performer_arrived => 'عمرہ اداکار کا مقدس کعبہ تک پہنچنا 🕋';

  @override
  String get video_display_error => 'ایک خطا رونما ہوئی، براہ کرم ویڈیو دکھانے کے لئے دوبارہ کوشش کریں';

  @override
  String get trim_hair => 'بال کا حصہ کاٹیں ✂️';

  @override
  String get performer_hastened => 'اداکار صفا اور مروہ کے درمیان جلدی کرتا رہا 🕋';

  @override
  String get performer_circumambulated => 'اداکار نے کعبہ کے گرد چکر کیے 🕋';

  @override
  String get confirmation => 'تصدیق';

  @override
  String get did_not_started_yet => 'ابھی تک شروع نہیں ہوا';

  @override
  String get you => 'آپ';

  @override
  String get register_now => 'اب آسانی سے اپنی عمرہ کی درخواست دیں 🕋';

  @override
  String get we_are_happy => 'ہم آپ کے ہمسفری کا انتخاب کرنے پر خوش ہیں، اور ہم وعدہ کرتے ہیں کہ ہم آپ کو انتہائی اور ہمارے قیمتی صارفین اور فوائد حاصل کرنے والوں کے مطابق خدمات فراہم کرنے کی کوشش کریں گے۔ آپ ہمارے دلوں میں عزیز ہیں، اور آپ کو ہماری محبت اور مدد کا حق ہے۔ لہذا، کسی بھی معلومات کی سوالیہ نہ کرنے میں ہمیں سہارا دیں، کیونکہ ہم ہمیشہ آپ کی حمایت کرنے کیلئے یہاں ہیں۔';

  @override
  String get authorization => 'یہ ایک الیکٹرانک ایپلیکیشن ہے جو مکہ المکرمہ کے معاقل میں موجود شرعی طور پر کوالیفائیڈ سروس فراہم کنندگان کو ان کیلئے حج اور عمرہ کرنے کی اجازت دینے کی عمل کو آسان بناتا ہے۔ (جیسے مریض جن کا شفاء نہیں ہو سکتا، بے بال کا، بوڑھے جو سفر نہیں کر سکتے، مردہ) اور ان تمام خدمت فراہم کنندگان جنہوں نے پہلے اپنے لئے حج اور عمرہ ادا کیا ہے، کیونکہ وہ قرآن کے حافظ اور اسلامی علم کے طلباء ہیں، یعنی، اس قوم کے بہترین سے (اور ہم انہیں ایسا شمار کرتے ہیں)۔ یہ انہیں اپنی تعلیمی سفر جاری رکھنے اور قوم کو فائدہ مند بنانے میں ان کی مدد کرنے کے لئے ایک معاونت مدد کرنے کے لئے ادا کیا گیا ہے۔ اختیار ٹیم کا کام ان کو خوش انتخاب کرنے پر روکنے کی غفلت نہیں کرتا، بلکہ ان کے لئے تربیتی کورسز کا انعقاد کرتا ہے تاکہ ان کی آگاہی بڑھائی جائے، ان کو یاد دلایا جائے، اور نیت کو تازہ کیا جائے کہ ان کا کام ان کے بھائیوں اور بہنوں کی مدد کرنا ہے، اور کہ ہر چیز کا بنیادی مقصد اللہ کے پاس بھائی اور بہنوں سے اجرت کی التماس کرنا ہے۔ اور نیت کو تازہ کرتے ہوئے مادی تلاشی کے لئے دینی نقصان کے کوئی طائفہ نہیں ہے، کیونکہ حج یا عمرہ کی عبادت ایک مختلط عبادت ہے (مالی اور جسمانی)، اور اس میں دونوں پہلوؤں میں محنت ہوتی ہے، اور اللہ بہتر جانتا ہے۔';

  @override
  String get more => 'مزید...';

  @override
  String get less => 'کم...';

  @override
  String get our_message => 'ہمارا پیغام';

  @override
  String get facilitating_muslims => 'تمام زمین کے مسلمانوں کو فوائد اور ثواب حاصل کرنے میں مدد فراہم کرنے کے لئے تیزی سے';

  @override
  String get our_goals => 'ہمارے اہداف';

  @override
  String get umrah_student => 'عمرہ طالب علم';

  @override
  String get introduction => 'تعارف';

  @override
  String get taffweed => 'تفويض';

  @override
  String get opening_doors => 'ہماری خدمات سے فائدہ اٹھانے والے مسلمانوں کے لئے خوشخبری اور امید کا دروازہ کھولنا، اجر حاصل کرنے اور تعاون کے اصول کو عملی بنانے، اور ہماری عرب اور اسلامی سماجات کی ضروریات کو پورا کرنے والا ایک تقنی متقدم نمونہ فراہم کرنا۔';

  @override
  String get values => 'ہماری اقدار';

  @override
  String get values_description => 'معاشرتی افراد کے درمیان تعاون ایک فرض اور ضرورت ہے، ایک نظریہ نہیں۔ بھلائی کا ظاہر کرنا قوم کی سب سے زیادہ فرضوں میں سے ایک ہے۔ افراد کو آسانی سے فراہم کرنا، خاص طور پر جن لوگوں کے پاس لائسنس ہوتا ہے، ان کے حقوق جن کو ہم ان کی حقیقی منتخبوں کو پہنچانے کی کوشش کر رہے ہیں۔';

  @override
  String get privacy_policy => 'رازداری پالیسی';

  @override
  String get privacy_policy_description => 'Tafweed ایپلیکیشن کی مینجمنٹ، صارفین کی داخلہ شدہ ڈیٹا کی امن، اطمینان، اور مکمل خفیہ رکھنے کے تعلقات پر پابند ہے؛ اطلاعات اور الیکٹرانک ادائیگی یا بینکی حوالہ کرنے کے اطلاعات کی حفاظت کے لئے صارفین کی داخلہ شدہ اطلاعات اور ادائیگی کی قیمت کے لئے بینکی ٹرانسفر کی معلومات کی حفاظت کرتا ہے؛ اور اس کے علاوہ، شخصی سروس درخواست دہندہ (فائدہ اُٹھانے والا) جیسے (پہلا نام - آخری نام - ای میل - ملک - موبائل نمبر) کی اطلاعات کی حفاظت کرتا ہے۔';

  @override
  String get contact_information => 'رابطہ کی معلومات';

  @override
  String get contact_information_description => 'Tafweed ایپلیکیشن، تجربہ بہتر بنانے میں مددگار معلومات جیسے آلہ کی چالو زبان اور اس کا آپریٹنگ سسٹم کی قسم جمع کرتا ہے؛ یہ عربی سعودیہ اور متحدہ عرب امارات کی مقامی ضوابط کے مطابق کیا جاتا ہے۔';

  @override
  String get information_protection_and_storage => 'معلومات کی حفاظت اور ذخیرہ';

  @override
  String get information_protection_and_storage_description => 'Tafweed ایپلیکیشن، صارف کی معلومات کو ایپلیکیشن مینجمنٹ کے طے کردہ سروروں میں سنٹرالائز کرتا ہے تاکہ یہ ڈیٹا کیبر حفاظت کی فراہمی کے لئے محفوظ ہو۔ اس لئے، ایپلیکیشن مینجمنٹ کی اختیار کیا گیا کہ اس ڈیٹا کے کچھ حصے کو بیمہ شراکت داروں (تیسری شخص کی طرف) کے سروروں کے ساتھ شیئر کیا جا سکتا ہے، کام کی فطرت اور ضرورتوں کے مطابق اور رازداری اور غیر افشاء کی معاہدے۔';

  @override
  String get general_terms => 'عام شرائط';

  @override
  String get general_terms_description => 'سلامتی مطالبات اور قوانین کے مطابق، رازداری پالیسی میں کچھ تبدیلیاں ہو سکتی ہیں، اور Tafweed ایپلیکیشن کو رازداری پالیسی کے شرائط میں شامل کرنے یا تبدیل کرنے کا حق ہے؛ اس لئے، ہم آپ کو اسے مکمل کرنے کے لئے معاہدہ کرنے کی سفارش دیتے ہیں۔ علاوہ ازیں، ایپلیکیشن مینجمنٹ کوئی بھی رازداری پالیسی میں کوئی تبدیلیوں کو قبول نہیں کرنے پر صارف حساب کا خاتمہ کرنے کا حق رکھتا ہے۔';

  @override
  String get terms_of_use => 'استعمال کی شرائط';

  @override
  String get terms_of_use_description => '- سروس فراہم کنندگان: وہ افراد ہیں جو خدمت فراہم کرتے ہیں اور ایپلیکیشن کے ذریعے منظوری دینے اور ان کے ساتھ معاہدہ کرنے کے قابل ہیں۔ - ایپلیکیشن مینجمنٹ: وہ کام کرنے والا ٹیم ہے جو صارفین کے ساتھ اور سروس فراہم کنندگان کے درمیان درمیانی فراہمی فراہم کرتی ہے، کاموں کی ترتیبات کو منظم کرتی ہے، دونوں طرفوں کے حقوق کی ضمانت فراہم کرتی ہے، اور کارروائی اور نگرانی کے کاموں کو منظم کرتی ہے۔';

  @override
  String get service_description => 'خدمت کی تفصیل';

  @override
  String get service_description_content => 'Tafweed ایپلیکیشن، خدمت فراہم کنندگان اور فائدہ اُٹھانے والوں کے درمیان الیکٹرانک وسیلہ کے طور پر کام کرتا ہے اور یہ یقینی بناتا ہے کہ خدمت فراہم کنندگان کو اعلی معیار کی صلاحیت اور کارکردگی فراہم کی جاتی ہے۔ یہ عمرہ رسومات کے دوران قدموں کو ویڈیو میں دستاویزی کرتا ہے اور انہیں ایپلیکیشن میں صارفین کے اکاؤنٹس پر بھیجتا ہے۔';

  @override
  String get nature_of_contract => 'معاہدے کی فطرت';

  @override
  String get nature_of_contract_content => 'ہماری فراہم کردہ تمام خدمات الیکٹرانک ہیں اور صارفین کے ساتھ بھی الیکٹرانک طور پر کام کیا جاتا ہے، لہذا اسے ایپلیکیشن میں اکاؤنٹ رجسٹریشن، استعمال کی شرائط کی طرح تین طرفہ الیکٹرانک معاہدہ تصور کیا جاتا ہے، جو کہ صارفین، ایپلیکیشن مینجمنٹ، اور خدمت فراہم کنندگان کے درمیان ہوتا ہے، اور یہ فونڈیشن اور آپریشن ملکوں میں موجود قانونی ضوابط کو دھیان میں رکھتا ہے۔';

  @override
  String get payment_method => 'ادائیگی کا طریقہ';

  @override
  String get payment_method_content => 'ایپلیکیشن، متعلقہ نگرانی میں اور وصول ملک کی حدود کے اندر کریڈٹ کارڈ یا کسی بھی الیکٹرانک ادائیگی طریقے کے ذریعے مختلف ادائیگی کے طریقوں کی فراہمی کرتا ہے۔ متعلقہ بینک سنٹرل قوانین اور ضوابط پر مبنی ہوتا ہے۔';

  @override
  String get cancellation => 'منسوخ کرنا';

  @override
  String get cancellation_content => 'مشتری کو فراہم کی گئی خدمت کو منسوخ کرنے کا حق ہوتا ہے اگر ایپلیکیشن کے انتظامیہ نے خدمت فراہم کرنے کی درخواست خدمت فراہم کرنے والے کو نہیں بھیجی ہو؛ عموماً اس کا حد معمولی طور پر ٤ گھنٹوں میں کیا جاتا ہے اور ضرورت کے وقتوں میں اور سیزن میں ٨ گھنٹوں میں، اور اس کے بعد مشتری کو مزید نقصان کے بارے میں اطلاع دی گئی تو منسوخ کرنے کا حق نہیں ہوتا۔';

  @override
  String get compensation => 'تعویض';

  @override
  String get compensation_content => 'اگر خدمت فراہم کنندہ خدمت فراہم نہیں کرتا ہو یا عمرہ مناسک کو انجام دینے میں غلطی کرتا ہو (جو کہ نادر ہوتا ہے)، تو ایپلیکیشن کی مینجمنٹ کو ایک دوسرے خدمت فراہم کنندہ کو فراہم کرنے کے لئے فراہم کرنا ہوگا بغیر کسی اضافی رقم کی درخواست کے۔';

  @override
  String get terms_and_conditions => 'شرائط و ضوابط';

  @override
  String get payment_error => 'ادائیگی کے عمل کے دوران ایک خطا واقع ہوا';

  @override
  String get choose_app_language => 'براہ کرم درخواست کی زبان منتخب کریں';

  @override
  String get service_providers => '- خدمات فراہم کنندگان: وہ افراد ہیں جو خدمت فراہم کرتے ہیں اور ایپلیکیشن کے ذریعے منظوری دینے اور ان کے ساتھ معاہدہ کرنے کے قابل ہیں۔';

  @override
  String get app_management => '- ایپلیکیشن کی انتظامیہ: وہ ٹیم ہے جو ایپلیکیشن کے صارفین اور خدمات فراہم کنندگان کے درمیان ایک واسطہ کے طور پر کام کرتی ہے، کام کی منظم کرتی ہے، دونوں طرفوں کے حقوق کو یقینی بناتی ہے، اور آپریشنل اور ریگولیٹری پروسیسز کو انتظام کرتی ہے۔';

  @override
  String get judgments => 'فیصلے';

  @override
  String get home => 'ہوم';

  @override
  String get last_price => 'آخری قیمت';

  @override
  String get before_discount => 'چھوٹ سے پہلے';

  @override
  String get follow_rituals => 'رسومات کی پیروی کریں';

  @override
  String get you_got_discount => 'آپ کو چھوٹ ملی';

  @override
  String get rate => 'شرح';

  @override
  String get share => 'شیئر';

  @override
  String get type => 'قسم';

  @override
  String get request_number => 'درخواست نمبر';

  @override
  String get enter_person_details => 'شخص کی تفصیلات درج کریں';

  @override
  String get about_him => 'اس کے بارے میں';

  @override
  String get contact_us => 'ہم سے رابطہ کریں';

  @override
  String get contact_us_now => 'اب ہم سے رابطہ کریں اور آپ کو جلد از جلد جواب دیا جائے گا';

  @override
  String get paid => 'ادا کیا گیا';

  @override
  String get nothing_new_to_change => 'تبدیل کرنے کے لیے کچھ نیا نہیں ہے';

  @override
  String get mufawwid => 'مختار';

  @override
  String get request_umrah_for_loved_ones => 'اپنے پیاروں کے لیے تفویض ایپ کے ذریعے عمرہ طلب کریں';

  @override
  String get in_tafweeed_we_perform_umrah_for_the_sick_disabled_deceased => 'تفویض میں ہم بیمار، معذور اور وفات یافتہ افراد کے لیے عمرہ کرتے ہیں';

  @override
  String get prophet_said_follow_up_hajj_and_umrah_remove_poverty_sins => 'نبی ﷺ نے فرمایا: حج اور عمرہ کو پے در پے ادا کرو، کیونکہ یہ غربت اور گناہوں کو مٹا دیتے ہیں';

  @override
  String get tafweeed_app_is_source_of_good_request_umrah_now => 'تفویض ایپ نیکی کا ایک چشمہ ہے، ابھی عمرہ طلب کریں';

  @override
  String get guide_to_good_is_like_the_doer_of_good_in_tafweeed => 'نیکی کی طرف رہنمائی کرنے والا اُس کے کرنے والے کی طرح ہے، اور تفویض میں ہم آپ کو عظیم نیکی اور کریم رب کے ثواب کی طرف رہنمائی کرتے ہیں';

  @override
  String get you_can_complete_umrah_for_disabled_person => 'آپ کسی معذور شخص کی طرف سے عمرہ مکمل کر سکتے ہیں';

  @override
  String get registration_done_successfully_now_login => 'رجسٹریشن کامیابی سے مکمل ہو گئی، اب لاگ ان کریں';
}
